# ***Water Analysis***

> importing modules

In [399]:
import numpy as np
import pandas as pd

> imporing data from excell sheet

In [400]:
data = pd.read_excel("GWQ_2010-2018.xlsx",sheet_name="Sheet1")

### Basic data analysis

In [401]:
data.head()

,SITE_ID,WRIS ID,LATITUDE,LONGITUDE,SITE_TYPE,STATE_NAME,DISTRICT_NAME,TAHSIL_NAME,BLOCK_NAME,SITE_NAME,...,FLUORIDE,SAR,RSC,SiO2,PO4,TDS,Turbidity,%Na,Arsenic,LR. No
0,W115159092441001,W23881,11.866389,92.736111,Dug Well,Andaman And Nicobar,A & N Islands,Ferrargunj,South Andaman,Shoal Bay– 15 No.,...,0.37,NaN,NaN,13.97,NaN,217.748,NaN,NaN,NaN,NaN
1,New,W38814,12.186944,92.791667,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Baratang Island,South Creek (Sundergarh),...,0.24,0,0,15.14,0,360.745,,,0,0
2,W123014092513301,W24095,12.503889,92.859167,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Bakultala,...,0.96,0,0,7.67,0,239.246,NaN,NaN,0,NaN
3,W123129092581301,W24112,12.524722,92.970278,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Nimbutala,...,1.02,0,0,0,0,253.22,NaN,NaN,0,NaN
4,W123030092573801,W24098,12.508333,92.960556,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Padmanavapuram,...,0.74,0,0,10.34,0,185.361,NaN,NaN,0,NaN

In [402]:
data.count()

SITE_ID           85197
WRIS ID           85197
LATITUDE          84916
LONGITUDE         84916
SITE_TYPE         85197
STATE_NAME        85197
DISTRICT_NAME     85196
TAHSIL_NAME       85085
BLOCK_NAME        85071
SITE_NAME         85197
BASIN_NAME        85197
PROJECT_NAME      85197
year              85197
PH                85193
EC                85194
TH                81780
TOT_ALKALINITY    68788
CA                82060
MG                82049
NA                82056
K                 81988
FE                68575
CARBONATE         79104
BICARBONATE       81973
CHLORIDE          85185
SULPHATE          82060
NITRATE           81056
FLUORIDE          83992
SAR               69351
RSC               67521
SiO2              21338
PO4               22929
TDS               21477
Turbidity          3409
%Na                4025
Arsenic           15535
LR. No            10911
dtype: int64

In [403]:
data.describe()

               year
count  85197.000000
mean    2014.493738
std        2.551327
min     2010.000000
25%     2012.000000
50%     2015.000000
75%     2017.000000
max     2018.000000

In [404]:
data.head()

,SITE_ID,WRIS ID,LATITUDE,LONGITUDE,SITE_TYPE,STATE_NAME,DISTRICT_NAME,TAHSIL_NAME,BLOCK_NAME,SITE_NAME,...,FLUORIDE,SAR,RSC,SiO2,PO4,TDS,Turbidity,%Na,Arsenic,LR. No
0,W115159092441001,W23881,11.866389,92.736111,Dug Well,Andaman And Nicobar,A & N Islands,Ferrargunj,South Andaman,Shoal Bay– 15 No.,...,0.37,NaN,NaN,13.97,NaN,217.748,NaN,NaN,NaN,NaN
1,New,W38814,12.186944,92.791667,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Baratang Island,South Creek (Sundergarh),...,0.24,0,0,15.14,0,360.745,,,0,0
2,W123014092513301,W24095,12.503889,92.859167,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Bakultala,...,0.96,0,0,7.67,0,239.246,NaN,NaN,0,NaN
3,W123129092581301,W24112,12.524722,92.970278,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Nimbutala,...,1.02,0,0,0,0,253.22,NaN,NaN,0,NaN
4,W123030092573801,W24098,12.508333,92.960556,Dug Well,Andaman And Nicobar,A & N Islands,Middle Andaman,Mayabunder,Padmanavapuram,...,0.74,0,0,10.34,0,185.361,NaN,NaN,0,NaN

In [405]:
neww_data = data.filter(['PH','EC','TH','TOT_ALKALINITY','FLUORIDE'], axis=1)

In [406]:
neww_data

         PH     EC   TH TOT_ALKALINITY FLUORIDE
0      8.34    355  130            160     0.37
1      8.46    596  120            205     0.24
2      8.11    394  160            155     0.96
3      7.89    448  200            200     1.02
4      8.01    309  125            130     0.74
...     ...    ...  ...            ...      ...
85192  7.83  118.1   60             60        0
85193   7.8    494  125             65     0.05
85194  7.85  480.9  200             55     0.38
85195  8.05  39.46   20             20        0
85196  7.71    530  175            130     0.34

[85197 rows x 5 columns]

# ***Now we have new dataset***

### **Now we will save it and do further analysis with it**

In [425]:
# we will comment it so that it creates ones
# new_data.to_excel('new_data.xlsx',sheet_name='Sheet1')

In [426]:
new_data = pd.read_excel("new_data.xlsx",sheet_name="Sheet1")
new_data.count()

PH                83675
EC                84840
TH                76260
TOT_ALKALINITY    53287
FLUORIDE          79561
dtype: int64

In [427]:
new_data.head()

     PH   EC     TH  TOT_ALKALINITY FLUORIDE
0  8.34  355  130.0           160.0     0.37
1  8.46  596  120.0           205.0     0.24
2  8.11  394  160.0           155.0     0.96
3  7.89  448  200.0           200.0     1.02
4  8.01  309  125.0           130.0     0.74

In [428]:
new_data.describe()

                 TH  TOT_ALKALINITY
count  76260.000000    53287.000000
mean     318.544085      215.323489
std      342.862109      173.484580
min        0.010000        0.008197
25%      145.000000      100.000000
50%      240.192000      190.160000
75%      380.000000      300.000000
max    11100.000000     7909.840000

In [429]:
new_data.shape

(85197, 5)

> Now we will drop rows where Fluoride is Na

In [430]:
# new_data = new_data.dropna(subset=["FLUORIDE"])
new_data = new_data.dropna(axis=0)

In [431]:
new_data.shape

(50088, 5)

In [432]:
new_data['PH'].isna().sum()

0

In [433]:
new_data['EC'].isna().sum()

0

In [434]:
new_data['TH'].isna().sum()

0

In [435]:

new_data['TOT_ALKALINITY'].isna().sum()

0

In [436]:
new_data['FLUORIDE'].isna().sum()

0

> **Now we will fill the black cell of features**

In [437]:
new_data = new_data.assign(PH = new_data['PH'].fillna(new_data['PH'].median))
# new_data['PH'] = new_data['PH'].fillna(new_data['PH'].median)

In [438]:
new_data = new_data.assign(EC = new_data['EC'].fillna(new_data['EC'].median))
# new_data.loc[:][1] = new_data['EC'].fillna(new_data['EC'].median)

In [439]:
new_data = new_data.assign(TH = new_data['TH'].fillna(new_data['TH'].median))
# new_data.loc[:][2] = new_data['TH'].fillna(new_data['TH'].median)

In [440]:
new_data = new_data.assign(TOT_ALKALINITY = new_data['TOT_ALKALINITY'].fillna(new_data['TOT_ALKALINITY'].median))
# new_data.loc[:][3] = new_data['TOT_ALKALINITY'].fillna(new_data['TOT_ALKALINITY'].median)

In [441]:
new_data.count()

PH                50088
EC                50088
TH                50088
TOT_ALKALINITY    50088
FLUORIDE          50088
dtype: int64

# ***Now our data is ready to go further***

In [442]:
new_data.astype(float)
# new_data[:][5920:5921]
# new_data.count(axis=0)
# new_data['FLUORIDE'].isna().sum()

         PH      EC     TH  TOT_ALKALINITY  FLUORIDE
0      8.34  355.00  130.0           160.0      0.37
1      8.46  596.00  120.0           205.0      0.24
2      8.11  394.00  160.0           155.0      0.96
3      7.89  448.00  200.0           200.0      1.02
4      8.01  309.00  125.0           130.0      0.74
...     ...     ...    ...             ...       ...
85192  7.83  118.10   60.0            60.0      0.01
85193  7.80  494.00  125.0            65.0      0.05
85194  7.85  480.90  200.0            55.0      0.38
85195  8.05   39.46   20.0            20.0      0.01
85196  7.71  530.00  175.0           130.0      0.34

[50088 rows x 5 columns]

In [443]:
new_data.corr()

                      PH        EC        TH  TOT_ALKALINITY
PH              1.000000 -0.000904 -0.001070       -0.003723
EC             -0.000904  1.000000  0.807535        0.382508
TH             -0.001070  0.807535  1.000000        0.247338
TOT_ALKALINITY -0.003723  0.382508  0.247338        1.000000